topics/ubuntu-cobbler/index.org
#+TITLE: Install Ubuntu with Cobbler
#+DATE: [2015-03-28 Sat 16:22]
#+DESCRIPTION: Let's see if this is easier than FAI.
#+SETUPFILE: ~/org-pub/topics/setup.org

Following 
 - https://help.ubuntu.com/community/Cobbler

#+BEGIN_EXAMPLE
  # apt-get install cobbler cobbler-web debmirror
  # cobbler check
  # cobbler get-loaders
  # service cobbler restart
  # cobbler sync
  task started: 2015-03-28_162453_sync
  task started (id=Sync, time=Sat Mar 28 16:24:53 2015)
  running pre-sync triggers
  cleaning trees
  mkdir: /var/lib/tftpboot/pxelinux.cfg
  mkdir: /var/lib/tftpboot/grub
  mkdir: /var/lib/tftpboot/images
  mkdir: /var/lib/tftpboot/s390x
  mkdir: /var/lib/tftpboot/ppc
  mkdir: /var/lib/tftpboot/etc
  removing: /var/lib/tftpboot/grub/images
  copying bootloaders
  copying: /var/lib/cobbler/loaders/pxelinux.0 -> /var/lib/tftpboot/pxelinux.0
  copying: /var/lib/cobbler/loaders/menu.c32 -> /var/lib/tftpboot/menu.c32
  copying: /usr/lib/syslinux/pxelinux.0 -> /var/lib/tftpboot/pxelinux.0
  copying: /usr/lib/syslinux/menu.c32 -> /var/lib/tftpboot/menu.c32
  copying: /usr/lib/syslinux/chain.c32 -> /var/lib/tftpboot/chain.c32
  copying: /boot/memtest86+.bin -> /var/lib/tftpboot/images/memtest86+.bin
  copying: /boot/memtest86+_multiboot.bin -> /var/lib/tftpboot/images/memtest86+_multiboot.bin
  copying: /boot/memtest86+.elf -> /var/lib/tftpboot/images/memtest86+.elf
  copying: /var/lib/cobbler/loaders/yaboot -> /var/lib/tftpboot/yaboot
  copying: /usr/lib/syslinux/memdisk -> /var/lib/tftpboot/memdisk
  copying: /var/lib/cobbler/loaders/grub-x86_64.efi -> /var/lib/tftpboot/grub/grub-x86_64.efi
  copying: /var/lib/cobbler/loaders/grub-x86.efi -> /var/lib/tftpboot/grub/grub-x86.efi
  copying distros to tftpboot
  copying images
  generating PXE configuration files
  generating PXE menu structure
  rendering TFTPD files
  generating /etc/xinetd.d/tftp
  cleaning link caches
  running post-sync triggers
  running python triggers from /var/lib/cobbler/triggers/sync/post/*
  running python trigger cobbler.modules.sync_post_restart_services
  running shell triggers from /var/lib/cobbler/triggers/sync/post/*
  running python triggers from /var/lib/cobbler/triggers/change/*
  running python trigger cobbler.modules.scm_track
  running shell triggers from /var/lib/cobbler/triggers/change/*
  ,*** TASK COMPLETE ***
#+END_EXAMPLE

Import ISO

#+BEGIN_EXAMPLE
  # wget http://releases.ubuntu.com/14.10/ubuntu-14.10-desktop-amd64.iso
  # mount -o loop ubuntu-14.10-desktop-amd64.iso /mnt
  # cobbler signature update
  # cobbler import --name=utopic --path=/mnt --breed=ubuntu
  No signature matched in /var/www/cobbler/ks_mirror/utopic
  !!! TASK FAILED !!!
#+END_EXAMPLE

Apparently no [[http://www.cobblerd.org/manuals/2.6.0/3/2/3_-_Distro_Signatures.html][distro signatures]].

#+BEGIN_EXAMPLE
  # cobbler signature update
  # cobbler signature report --name=ubuntu
  Currently loaded signatures:
  ubuntu:
          lucid
          oneiric
          precise
          quantal
          raring
          saucy
          trusty

  Breed 'ubuntu' has 7 total signatures
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # umount /mnt
  # wget http://releases.ubuntu.com/14.04/ubuntu-14.04.2-desktop-amd64.iso
  # mount -o loop ubuntu-14.04.2-desktop-amd64.iso /mnt
  # cobbler import --name=trusty --path=/mnt --breed=ubuntu
#+END_EXAMPLE

Same deal.  

Okay, found 3 day old message on a [[https://github.com/cobbler/cobbler/issues/1331][GitHub issue]] saying I really can't use Desktop, gotta use the server variant.

#+BEGIN_EXAMPLE
  # wget http://releases.ubuntu.com/14.04/ubuntu-14.04.2-server-amd64.iso
  # rm -rf /var/www/cobbler/ks_mirror/{trusty,ubuntu-14.04.2,ubuntu-desktop,utopic}
  # mount -o loop ubuntu-14.04.2-server-amd64.iso /mnt
  # cobbler import --name=ubuntu-14.04.2 --path=/mnt
#+END_EXAMPLE

Okay, completed.  Next.
